docs/diagrams/sequence/mermaid/structurizr-SearchToInvite.mmd
graph LR
  linkStyle default fill:#ffffff

  subgraph diagram ["Dynamic View: Task Management"]
    style diagram fill:#ffffff,stroke:#ffffff

    subgraph 3 ["Task Management"]
      style 3 fill:#ffffff,stroke:#005696,color:#005696

      16("<div style='font-weight: bold'>Task Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Task Service</div>")
      style 16 fill:#ffffff,stroke:#005696,color:#005696
      30("<div style='font-weight: bold'>Authentication Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Authentication Service</div>")
      style 30 fill:#ffffff,stroke:#005696,color:#005696
      4["<div style='font-weight: bold'>UI</div><div style='font-size: 70%; margin-top: 0px'>[Container: React]</div><div style='font-size: 80%; margin-top:10px'>Single Page Application</div>"]
      style 4 fill:#ffffff,stroke:#005696,color:#005696
      5("<div style='font-weight: bold'>API Gateway</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Cloud Gateway]</div><div style='font-size: 80%; margin-top:10px'>API Gateway</div>")
      style 5 fill:#ffffff,stroke:#005696,color:#005696
      6("<div style='font-weight: bold'>Profile Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Profile Service</div>")
      style 6 fill:#ffffff,stroke:#005696,color:#005696
    end

    1["<div style='font-weight: bold'>User</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>End User</div>"]
    style 1 fill:#ffffff,stroke:#4c8a1e,color:#4c8a1e

    1-. "<div>1. 1. Gõ keyword (email/name)</div><div style='font-size: 70%'></div>" .->4
    4-. "<div>2. 2. GET<br />/api/tasks/search-users</div><div style='font-size: 70%'>[JSON/HTTP]</div>" .->5
    5-. "<div>3. 3. Forward request</div><div style='font-size: 70%'></div>" .->16
    16-. "<div>4. 4. Fetch Auth info (Feign<br />Client)</div><div style='font-size: 70%'>[OpenFeign/HTTP]</div>" .->30
    16-. "<div>5. 5. Fetch Profile info<br />(Feign Client)</div><div style='font-size: 70%'>[OpenFeign/HTTP]</div>" .->6

  end
